4_sample_app-rspec/sample_app/app/controllers/todolists_controller.rb

  def create
    @list = List.new(list_params)
    if @list.save
---
INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "aaaa"], ["body", "aaa"], ["created_at", "2023-04-22 08:17:25.716990"], ["updated_at", "2023-04-22 08:17:25.716990"]]

  def destroy
    list = List.find(params[:id])
    list.destroy
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]